<?php include_once("../layout/LayoutHeader.php"); ?>

<body>
    <div class="wrapper">
        <div class="header">
            <div class="row">
                <div class="col-1 arrow">
                    <a class="zmdi zmdi-arrow-left" style="color: white;" href="javascript:history.back(1)"></a>
                </div>
                <div class="col">
                    <span class="title-header">
                        รายงานปัจจุบัน
                    </span>
                </div>
            </div>
        </div>

        <div class="grid-scroll">

            <div class="row padding-top7">

                <div class="col-6 set-padding">
                    <div class="card border-left-primary card-color-one shadow h-100">
                        <div class="card-body">
                            <div class="row no-gutters align-items-center">
                                <div class="col mr-2">
                                    <div class="font-weight-bold  text-uppercase mb-1">ขนาดฟาร์ม</div>
                                    <div class="h5 mb-0 font-weight-bold text-gray-800">ขนาดเล็ก</div>
                                </div>
                                <div class="col-auto">
                                    <i class="fas fa-home" style="font-size: 1.5em;"></i>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
                <div class="col-6 set-padding">
                    <div class="card border-left-primary card-color-two shadow h-100">
                        <div class="card-body">
                            <div class="row no-gutters align-items-center">
                                <div class="col mr-2">
                                    <div class="font-weight-bold  text-uppercase mb-1">จำนวนโค</div>
                                    <div class="h5 mb-0 font-weight-bold text-gray-800">5 ตัว</div>
                                </div>
                                <div class="col-auto">
                                    <svg style="width:32px;height:32px" viewBox="0 0 22 22">
                                        <path fill="currentColor" d="M10.5,18A0.5,0.5 0 0,1 11,18.5A0.5,0.5 0 0,1 10.5,19A0.5,0.5 0 0,1 10,18.5A0.5,0.5 0 0,1 10.5,18M13.5,18A0.5,0.5 0 0,1 14,18.5A0.5,0.5 0 0,1 13.5,19A0.5,0.5 0 0,1 13,18.5A0.5,0.5 0 0,1 13.5,18M10,11A1,1 0 0,1 11,12A1,1 0 0,1 10,13A1,1 0 0,1 9,12A1,1 0 0,1 10,11M14,11A1,1 0 0,1 15,12A1,1 0 0,1 14,13A1,1 0 0,1 13,12A1,1 0 0,1 14,11M18,18C18,20.21 15.31,22 12,22C8.69,22 6,20.21 6,18C6,17.1 6.45,16.27 7.2,15.6C6.45,14.6 6,13.35 6,12L6.12,10.78C5.58,10.93 4.93,10.93 4.4,10.78C3.38,10.5 1.84,9.35 2.07,8.55C2.3,7.75 4.21,7.6 5.23,7.9C5.82,8.07 6.45,8.5 6.82,8.96L7.39,8.15C6.79,7.05 7,4 10,3L9.91,3.14V3.14C9.63,3.58 8.91,4.97 9.67,6.47C10.39,6.17 11.17,6 12,6C12.83,6 13.61,6.17 14.33,6.47C15.09,4.97 14.37,3.58 14.09,3.14L14,3C17,4 17.21,7.05 16.61,8.15L17.18,8.96C17.55,8.5 18.18,8.07 18.77,7.9C19.79,7.6 21.7,7.75 21.93,8.55C22.16,9.35 20.62,10.5 19.6,10.78C19.07,10.93 18.42,10.93 17.88,10.78L18,12C18,13.35 17.55,14.6 16.8,15.6C17.55,16.27 18,17.1 18,18M12,16C9.79,16 8,16.9 8,18C8,19.1 9.79,20 12,20C14.21,20 16,19.1 16,18C16,16.9 14.21,16 12,16M12,14C13.12,14 14.17,14.21 15.07,14.56C15.65,13.87 16,13 16,12A4,4 0 0,0 12,8A4,4 0 0,0 8,12C8,13 8.35,13.87 8.93,14.56C9.83,14.21 10.88,14 12,14M14.09,3.14V3.14Z" />
                                    </svg>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>

            </div>

            <div class="row">

                <div class="col-6 set-padding">
                    <div class="card border-left-primary card-color-three shadow h-100">
                        <div class="card-body">
                            <div class="row no-gutters align-items-center">
                                <div class="col mr-2">
                                    <div class="font-weight-bold  text-uppercase mb-1">จำนวนโคท้อง</div>
                                    <div class="h5 mb-0 font-weight-bold text-gray-800">9 ตัว</div>
                                </div>
                                <div class="col-auto">
                                    <svg style="width:28; height:28; " viewBox="0 0 64 64">
                                        <path fill="currentColor" d="m51.5 27c-.827 0-1.5.673-1.5 1.5s.673 1.5 1.5 1.5 1.5-.673 1.5-1.5-.673-1.5-1.5-1.5z" />
                                        <path fill="currentColor" d="m40.5 27c-.827 0-1.5.673-1.5 1.5s.673 1.5 1.5 1.5 1.5-.673 1.5-1.5-.673-1.5-1.5-1.5z" />
                                        <path fill="currentColor" d="m52.5 18c.827 0 1.5-.673 1.5-1.5s-.673-1.5-1.5-1.5-1.5.673-1.5 1.5.673 1.5 1.5 1.5z" />
                                        <path fill="currentColor" d="m39.5 18c.827 0 1.5-.673 1.5-1.5s-.673-1.5-1.5-1.5-1.5.673-1.5 1.5.673 1.5 1.5 1.5z" />
                                        <path fill="currentColor" d="m62.109 13.361c-.985-1.478-2.634-2.361-4.412-2.361h-.283l.012-.012c1.015-1.014 1.574-2.365 1.574-3.8 0-1.683-.804-3.29-2.15-4.3l-2.25-1.688c-.303-.229-.709-.263-1.047-.095-.339.17-.553.516-.553.895 0 1.548-.42 3.043-1.179 4.381-.806-.246-1.66-.381-2.546-.381h-6.551c-.885 0-1.74.135-2.545.381-.759-1.338-1.179-2.833-1.179-4.381 0-.379-.214-.725-.553-.895-.338-.167-.745-.132-1.047.095l-2.25 1.688c-1.346 1.009-2.15 2.617-2.15 4.3 0 1.436.559 2.786 1.574 3.801l.012.011h-.283c-1.777 0-3.427.883-4.412 2.361-.583.873-.891 1.891-.891 2.942v1.784l-14.725 1.338c-2.326.211-4.438 1.225-6.043 2.777-4.281 1.455-7.232 5.522-7.232 10.078v18.22c0 1.252.598 2.448 1.601 3.2l2.8 2.1c.175.133.387.2.599.2.152 0 .306-.035.447-.105.339-.17.553-.516.553-.895v-4.146c0-1.525-.848-2.896-2.211-3.578l-1.789-.894v-14.102c0-2.468 1.068-4.758 2.808-6.363-.126.34-.241.685-.33 1.043l-.105.426c-.254 1.011-.347 2.051-.277 3.091l.906 13.59c.004.06.014.118.028.176l2.95 11.8c-1.195.913-1.98 2.339-1.98 3.957v2c0 .553.447 1 1 1h8 4c.553 0 1-.447 1-1v-2c0-2.01-1.199-3.736-2.914-4.529l.339-2.369c.337-2.367.519-4.77.558-7.158.04.01.078.024.118.034.378 1.964 1.868 3.605 3.899 4.435v2.587h2v-2.068c.328.04.66.068 1 .068s.672-.028 1-.068v2.068h2v-2.587c1.811-.74 3.192-2.125 3.738-3.808 1.852-.281 3.681-.71 5.472-1.296.256 3.572.752 7.129 1.528 10.624l.058.261c-1.088.918-1.796 2.274-1.796 3.806v2c0 .553.447 1 1 1h8 4c.553 0 1-.447 1-1v-2c0-1.983-1.169-3.685-2.846-4.493l.144-.577c1.121-4.481 1.69-9.095 1.699-13.712 1.255-2.096 1.967-4.505 1.994-7.026 2.366-1.027 3.97-2.933 4.004-5.121h.002l.719-10.062c.892.636 1.949.991 3.066.991h1.218c.553 0 1-.447 1-1v-2.697c0-1.051-.308-2.069-.891-2.942zm-58.214 35.704c.681.341 1.105 1.027 1.105 1.789v2.146l-1.199-.899c-.502-.376-.801-.975-.801-1.601v-1.882zm45.222-41.065h.159c3.707 0 6.724 3.017 6.724 6.725 0 .16-.006.321-.017.479l-.328 4.592c-.538.13-1.09.204-1.655.204-3.859 0-7-3.141-7-7 0-1.887.772-3.686 2.117-5zm5.721-4.121.812.608c.845.634 1.35 1.644 1.35 2.701 0 .809-.31 1.592-.837 2.202-.682-.879-1.527-1.622-2.491-2.187.567-1.043.963-2.161 1.166-3.324zm-8.306 4.121c-.982 1.468-1.532 3.201-1.532 5 0 4.963 4.037 9 9 9 .51 0 1.012-.05 1.507-.133l-.244 3.412c-1.466-1.386-3.726-2.279-6.263-2.279-1.031 0-2.038.147-3 .438-.962-.291-1.969-.438-3-.438-2.537 0-4.797.893-6.263 2.278l-.719-10.073c-.012-.159-.018-.32-.018-.48 0-3.708 3.017-6.725 6.725-6.725zm-10.182-3.513.812-.608c.203 1.163.599 2.281 1.165 3.323-.964.566-1.808 1.309-2.491 2.187-.526-.609-.836-1.393-.836-2.201 0-1.057.505-2.067 1.35-2.701zm-5.35 11.816c0-.654.191-1.288.555-1.832.588-.883 1.56-1.411 2.616-1.454-.111.552-.171 1.123-.171 1.708 0 .207.008.413.022.621l.081 1.137-.551.551c-.623.622-1.452.966-2.334.966h-.218zm-7 6.697c0 2.206-1.794 4-4 4s-4-1.794-4-4c0-.62.146-1.216.415-1.761l6.8-.618c.512.691.785 1.513.785 2.379zm-16.729 10.027c2.078.142 3.729 1.86 3.729 3.973 0 1.933-1.378 3.549-3.203 3.919zm7.729 27.973h-2v-2h-2v2h-2v-1c0-1.654 1.346-3 3-3s3 1.346 3 3zm4-1v1h-2v-1c0-1.129-.39-2.159-1.023-2.997.008 0 .015-.003.023-.003 1.654 0 3 1.346 3 3zm-2.556-7.182-.314 2.195c-.044-.001-.085-.013-.13-.013-.655 0-1.3.129-1.899.375.49-3.462 1.365-6.838 2.617-10.086.091.03.184.05.275.08-.016 2.482-.197 4.987-.549 7.449zm9.556-3.818c-2.117 0-3.92-1.062-4.648-2.552 1.978.355 3.982.552 6.003.552h.289c.915 0 1.827-.037 2.735-.11-.847 1.25-2.481 2.11-4.379 2.11zm20 12h-2v-2h-2v2h-2v-1c0-1.654 1.346-3 3-3s3 1.346 3 3zm4 0h-2v-1c0-1.129-.39-2.159-1.023-2.997.008 0 .015-.003.023-.003 1.654 0 3 1.346 3 3zm-3-6c-.262 0-.522.027-.779.067l.002-.021c.347-3.127.569-6.292.683-9.462.732-.501 1.394-1.074 2.007-1.69-.181 3.557-.693 7.095-1.556 10.551l-.144.576c-.071-.003-.14-.021-.213-.021zm-.028-12c.011-.667.028-1.334.028-2l-2 .021c0 4.598-.257 9.241-.765 13.804l-.037.336c-.386-.095-.783-.161-1.198-.161-.476 0-.927.088-1.364.213-1.081-4.96-1.636-10.045-1.636-15.213l-2 .097c0 1.051.041 2.103.087 3.154l-.323.108c-3.27 1.088-6.674 1.641-10.119 1.641h-.289c-3.36 0-6.679-.535-9.874-1.571.321-.734.654-1.464 1.014-2.183l.399-.799-1.789-.895-.399.799c-2.307 4.614-3.834 9.532-4.571 14.662-.047-.001-.09-.013-.136-.013-.409 0-.8.063-1.181.156l-2.827-11.312-.061-.924c2.867-.449 5.069-2.929 5.069-5.92 0-3.263-2.619-5.92-5.864-5.993l-.044-.663c-.056-.832.018-1.664.221-2.474l.105-.427c.805-3.217 3.523-5.587 6.799-5.986-.132.5-.217 1.014-.217 1.543 0 3.309 2.691 6 6 6s6-2.691 6-6c0-.908-.212-1.779-.595-2.578l4.643-.422h1.17c1.117 0 2.175-.355 3.066-.992l.719 10.063h.002c.051 3.276 3.616 5.929 7.995 5.929 1.031 0 2.038-.147 3-.438.962.291 1.969.438 3 .438.675 0 1.326-.07 1.952-.188-.202 3.166-1.628 6.098-3.98 8.188zm2.028-10c-.928 0-1.829-.146-2.679-.435-.104-.035-.213-.053-.321-.053s-.217.018-.321.053c-.85.289-1.751.435-2.679.435-3.252 0-6-1.832-6-4s2.748-4 6-4c.928 0 1.829.146 2.679.435.209.07.434.07.643 0 .849-.289 1.75-.435 2.678-.435 3.252 0 6 1.832 6 4s-2.748 4-6 4zm12-15h-.218c-.882 0-1.711-.344-2.335-.967l-.55-.55.081-1.139c.014-.206.022-.412.022-.619 0-.585-.06-1.155-.17-1.708 1.055.043 2.027.571 2.616 1.454.363.544.554 1.177.554 1.832z" />
                                        <path fill="currentColor" d="m31 33c-.033 0-.066 0-.101.001-.463-2.28-2.484-4.001-4.899-4.001-2.757 0-5 2.243-5 5s2.243 5 5 5c.033 0 .066 0 .101-.001.463 2.28 2.484 4.001 4.899 4.001 2.757 0 5-2.243 5-5s-2.243-5-5-5zm0 8c-1.654 0-3-1.346-3.003-2.938.005-.034.016-.134.017-.168.013-.316-.125-.62-.372-.819-.18-.145-.401-.221-.627-.221-.084 0-.169.011-.252.032-.297.078-.539.114-.763.114-1.654 0-3-1.346-3-3s1.346-3 3-3 3 1.346 3.003 2.938c-.005.033-.016.135-.017.169-.013.316.126.621.373.819.247.197.573.267.881.187.294-.077.535-.113.76-.113 1.654 0 3 1.346 3 3s-1.346 3-3 3z" />
                                    </svg>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
                <div class="col-6 set-padding">
                    <div class="card border-left-primary card-color-four shadow h-100">
                        <div class="card-body">
                            <div class="row no-gutters align-items-center">
                                <div class="col mr-2">
                                    <div class="font-weight-bold  text-uppercase mb-1">จำนวนโคให้นม</div>
                                    <div class="h5 mb-0 font-weight-bold text-gray-800">5 ตัว</div>
                                </div>
                                <div class="col-auto">
                                    <i class="fas fa-tint" style="font-size: 1.5em;"></i>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>

            </div>

            <div class="row padding-top13">

                <div class="col-12">
                    <div class="card shadow">
                        <div class="card-header card-header-table py-3">
                            <span class="m-0 font-weight-bold">รายชื่อสัตว์เเพทย์ในระบบ</span>
                        </div>
                        <div class="card-body">
                            <canvas id="myChart1"></canvas>
                        </div>
                    </div>
                </div>

            </div>

            <div class="row padding-top13">

                <div class="col-12">
                    <div class="card shadow">
                        <div class="card-header card-header-table py-3">
                            <span class="m-0 font-weight-bold">จำนวนโคแต่ละช่วงอายุ</span>
                        </div>
                        <div class="card-body">
                            <canvas id="myChart2"></canvas>
                        </div>
                    </div>
                </div>

            </div>

            <div class="row padding-top13">

                <div class="col-12">
                    <div class="card shadow">
                        <div class="card-header card-header-table py-3">
                            <span class="m-0 font-weight-bold">ปริมาณน้ำนมปัจจุบัน(ลิตร/วัน)</span>
                        </div>
                        <div class="card-body">
                            <canvas id="myChart3"></canvas>
                        </div>
                    </div>
                </div>

            </div>

            <div class="row padding-top13">

                <div class="col-12">
                    <div class="card shadow">
                        <div class="card-header card-header-table py-3">
                            <span class="m-0 font-weight-bold">ปริมาณน้ำนมเฉลี่ย(ลิตร/วัน/ตัว)</span>
                        </div>
                        <div class="card-body">
                            <canvas id="myChart4"></canvas>
                        </div>
                    </div>
                </div>

            </div>

        </div>
    </div>
</body>

<?php include_once("../layout/LayoutFooter.php"); ?>
<script src="https://cdn.jsdelivr.net/npm/chart.js"></script>

<script>
    // === include 'setup' then 'config' above ===
    const data1 = {
        labels: [
            'พ่อโค',
            'โคสาว',
            'แม่โค'
        ],
        datasets: [{
            data: [300, 50, 100],
            backgroundColor: [
                'rgb(255, 99, 132)',
                'rgb(54, 162, 235)',
                'rgb(255, 205, 86)'
            ],
            hoverOffset: 4
        }]
    };
    const config1 = {
        type: 'pie',
        data: data1
    };
    var myChart1 = new Chart(
        document.getElementById('myChart1'),
        config1
    );
    // -----------
    const labels2 = [
        '1 ม.ค.',
        '5 ม.ค.',
        '7 ม.ค.',
        '10 ม.ค.',
        '11 ม.ค.',
        '12 ม.ค.',
    ];
    const data2 = {
        labels: labels2,
        datasets: [{
            backgroundColor: [
                'rgba(225, 6, 0, 0.7)',
                'rgba(225, 6, 0, 0.7)',
                'rgba(255, 159, 64, 0.9)',
                'rgba(255, 159, 64, 0.9)',
                'rgba(255, 159, 64, 0.9)',
                'rgba(201, 203, 207, 0.9)',
                'rgba(201, 203, 207, 0.9)'
            ],
            borderColor: [
                'rgb(255, 99, 132)',
                'rgb(255, 99, 132)',
                'rgb(255, 159, 64)',
                'rgb(255, 159, 64)',
                'rgb(255, 159, 64)',
                'rgb(255, 99, 132)',
                'rgb(255, 99, 132)'
            ],
            data: [4, 10, 7, 5, 20, 30, 20],
        }]
    };
    const config2 = {
        type: 'bar',
        data: data2,
        options: {
            plugins: {
                title: {
                    display: true,
                    text: 'Custom Chart Title'
                }
            }
        }
    };
    var myChart2 = new Chart(
        document.getElementById('myChart2'),
        config2
    );
    // -----------
    const DATA_COUNT3 = 5;
    const NUMBER_CFG3 = {
        count: DATA_COUNT3,
        min: 0,
        max: 10
    };
    const labels3 = ['โค1', 'โค2', 'โค3', 'โค4', 'โค5'];
    const data3 = {
        labels: labels3,
        datasets: [{
                label: 'บันทึกจริง',
                data: [1, 3, 5, 7, 9],
                backgroundColor: '#22ee55f5',
            },
            {
                label: 'คาดการณ์',
                data: [2, 4, 6, 8, 10],
                backgroundColor: 'rgba(201, 203, 207, 0.9)',
            }
        ]
    };
    const config3 = {
        type: 'bar',
        data: data3,
        options: {
            indexAxis: 'y',
            responsive: true,
            scales: {
                x: {
                    stacked: true,
                },
                y: {
                    stacked: true
                }
            }
        }
    };
    var myChart3 = new Chart(
        document.getElementById('myChart3'),
        config3
    );
    // -----------
    const DATA_COUNT4 = 3;
    const NUMBER_CFG4 = {
        count: DATA_COUNT4,
        min: 0,
        max: 200
    };
    const labels4 = ['Sep 22', '29', 'Oct 6'];
    const data4 = {
        labels: labels4,
        datasets: [{
                label: 'บันทึกจริง',
                data: [20, 80, 150],
                backgroundColor: '#22ee55f5',
            },
            {
                label: 'คาดการณ์',
                data: [40, 100, 170],
                backgroundColor: 'rgba(201, 203, 207, 0.9)'
            }
        ]
    };
    const config4 = {
        type: 'line',
        data: data4,
        options: {
            responsive: true,
            plugins: {
                legend: {
                    position: 'top',
                }
            }
        },
    };
    var myChart4 = new Chart(
        document.getElementById('myChart4'),
        config4
    );
    // -----------
</script>